In [1]:
import pandas as pd

## Series

In [ ]:
## Creating empty series
d=pd.Series()

In [ ]:
d

In [ ]:
## Creating series with one element
d=pd.Series(17)

In [ ]:
d

In [ ]:
## Creating series using tuple
t=(10,11,12)
d=pd.Series(t)

In [ ]:
d

In [ ]:
##  creating series using list
d=pd.Series([45,78,56,445,78])

In [ ]:
d

In [2]:
## Creating series with array
import numpy as np
arr=np.array([1,2,3,4])
d=pd.Series(arr)

In [ ]:
d

In [8]:
## Using dictonary
d={'a':1,'b':2,'c':3,'d':4}

In [9]:
b=pd.Series(d)

In [11]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
arr_2=np.array([1,2,3])
s_2=pd.Series(arr_2 ,index=['one','two','three'])
s_2

one      1
two      2
three    3
dtype: int64

In [6]:
## checking the datatype
type(s_2)

pandas.core.series.Series

In [10]:
## access the data
b[3]

4

In [12]:
b['a']

1

In [ ]:
s_2['one']

In [13]:
## Slicing operation
d=pd.Series([1,2,3,5,47,98,7,8,6,32,78,2,8,289,258,78])

In [14]:
d[0:9]

0     1
1     2
2     3
3     5
4    47
5    98
6     7
7     8
8     6
dtype: int64

In [15]:
d[[4,5,3,6]] ## multiple index

4    47
5    98
3     5
6     7
dtype: int64

In [16]:
d[4]=34  ## changing the element

In [17]:
d[4]

34

In [ ]:
arr3=np.array([1,2,4,6])
s=pd.Series(arr3,index=['one','Two','Three','Four'])   
s[0:9]

## DataFrame

In [18]:
## empty dataframe
d=pd.DataFrame()

In [19]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [20]:
## using nested list
data=[[1,2,3,4],[14,12,1,'a',8],[7,8,9]]

In [21]:
d=pd.DataFrame(data)

In [22]:
d

    0   1  2     3    4
0   1   2  3     4  NaN
1  14  12  1     a  8.0
2   7   8  9  None  NaN

In [23]:
data=[['abc',1],['def',2],['ghi',3],['hij'],['klm','a']]

In [26]:
d=pd.DataFrame(data,columns=['A','B']) ## chnaging the column

In [27]:
d

     A     B
0  abc     1
1  def     2
2  ghi     3
3  hij  None
4  klm     a

In [28]:
d=pd.DataFrame(data,index=['A','B','C','D','E'])  ## changing the index

In [29]:
d

     0     1
A  abc     1
B  def     2
C  ghi     3
D  hij  None
E  klm     a

In [30]:
## dataframe using dictonary
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}

In [31]:
d=pd.DataFrame(data)

In [32]:
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [ ]:
## Task:- change the name of columns while defining the dataframe

In [38]:
d.rename({'name':'Name','age':'Age'},axis=1) #,inplace=True)

  Name  Age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [37]:
d

  Name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [39]:
## Accessing the elements from dataframe
data=[['ALex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],['Boris',14,'Geo'],['Ken',18,'English']]

In [42]:
d=pd.DataFrame(data,columns=['Name','Age','Subject'])

In [43]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [44]:
## accessing one single column
d['Name']

0     ALex
1      Bob
2    Kelly
3    Boris
4      Ken
Name: Name, dtype: object

In [45]:
d[['Name','Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2  Kelly      Eco
3  Boris      Geo
4    Ken  English

In [47]:
d.iloc[:,[0,1]]

    Name  Age
0   ALex   10
1    Bob   12
2  Kelly   15
3  Boris   14
4    Ken   18

In [48]:
d.iloc[1:3,[0,1]]

    Name  Age
1    Bob   12
2  Kelly   15

In [49]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [50]:
## to acces the single element we use iloc it will always work with index
d.iloc[0,2] ## index of row ,columns

'Maths'

In [52]:
## loc will work on rows as well as names of columns
d.loc[:,['Name','Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2  Kelly      Eco
3  Boris      Geo
4    Ken  English

In [53]:
d.loc[:,1]

KeyError: 1

In [54]:
d.loc[3] ## getting the rows

Name       Boris
Age           14
Subject      Geo
Name: 3, dtype: object

In [ ]:
d.iloc[:,[1,2]]

In [55]:
d.iloc[:,1:3]

   Age  Subject
0   10    Maths
1   12  Science
2   15      Eco
3   14      Geo
4   18  English

In [ ]:
pwd